app/controllers/boards_controller.rb

	def index
    @boards = params[:tag_id].present? ? Tag.find(params[:tag_id]).boards : Board.all
    @boards = Board.page(params[:page])
---
SELECT COUNT(*) FROM `boards`
SELECT `boards`.* FROM `boards`

  def create
    board = Board.new(board_params)
    if board.save
---
INSERT INTO `boards` (`name`, `title`, `body`, `created_at`, `updated_at`) VALUES ('show', 'off', 'action', '2019-07-20 01:54:45', '2019-07-20 01:54:45')

  def update
    @board.update(board_params)
---
UPDATE `boards` SET `name` = '名無し3', `title` = '学びたい方3', `body` = '募集中3', `updated_at` = '2019-07-19 11:07:20' WHERE `boards`.`id` = 1

  def destroy
    @board.destroy
---
DELETE FROM `boards` WHERE `boards`.`id` = 3

  def set_target_board
    @board = Board.find(params[:id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 2 LIMIT 1