app/controllers/boards_controller.rb

SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1
---
  def update
    board = Board.find(params[:id])